tutorials/fluidSolidInteraction/beamInCrossFlow/constant/solid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    rubber
    {
        type        neoHookeanElastic;
        rho         rho [1 -3 0 0 0 0 0] 1000;
        E           E [1 -1 -2 0 0 0 0] 1e4;
        nu          nu [0 0 0 0 0 0 0] 0.4;
    }
);

// ************************************************************************* //
